app/controllers/story_page_controller.rb

SELECT `story_pages`.* FROM `story_pages` WHERE (story_pages.id > 2) ORDER BY `story_pages`.`id` DESC LIMIT 1
---
  def index
    @story_pages = StoryPage.all